; domain
(define (domain robotwaiter)
  (:requirements :strips :typing :negative-preconditions)

    (:types dish location table)

    (:predicates
    (robot-at ?a - location)                           ; robot is at location ?a
    (adjacent ?a1 - location ?a2 - location)           ; locations ?a1 and ?a2 are adjacent
    (dish-at ?d - dish ?a - location)                  ; dish ?d is at location ?a
    (carrying ?d - dish)                               ; robot is carrying dish ?d
    (free-hands)                                       ; robot's hands are free
    (table-at ?t - table ?a - location)                ; table ?t is at location ?a
    (order-at ?d - dish ?t - table)                    ; dish ?d is ordered at table ?t
    (served ?d - dish ?t - table)                                ; table ?t has been served
    )

  ; MOVE: robot walks from one area to an adjacent area.
  (:action move
    :parameters (?from - location ?to - location)
    :precondition (and
      (robot-at ?from)                          ; robot at area
      (adjacent ?from ?to)                      ; destination its adjacent to "from"
    )
    :effect (and
      (NOT (robot-at ?from))                    ; from has no robot
      (robot-at ?to)                            ; robot at destination
    )
  )

  (:action pick-up
      :parameters (?d - dish ?a - location)
      :precondition (and 
                    (robot-at ?a)
                    (dish-at ?d ?a)
                    (free-hands)
                    )
      :effect (and 
              (carrying ?d)
              (NOT (free-hands))
              (NOT (dish-at ?d ?a))
              )
  )

  (:action present-dish
      :parameters (?d - dish ?a - location ?t - table)
      :precondition (and 
                    (robot-at ?a)
                    (carrying ?d)
                    (table-at ?t ?a)
                    (order-at ?d ?t)
                    (NOT (served ?d ?t))
                    )
      :effect (and 
              (served ?d ?t)
              (NOT (carrying ?d))
              (free-hands)
              )
    )
)

; problem
(define (problem restaurant-delivery-simple)
  (:domain robotwaiter)
  
  (:objects
    kitchen1 kitchen2 hall dr1 dr2 dr3 dr4 dr5 dr6 dr7 dr8 dr9 dr10 dr11 dr12 dr13 dr14 dr15 dr16 - location
    dish1 dish2 - dish
    table1 - table
  )
  
  (:init
    ; Adjacencies
    (adjacent kitchen1 dr1)
    (adjacent kitchen1 dr4)
    (adjacent kitchen1 dr5)

    (adjacent kitchen2 dr3)
    (adjacent kitchen2 dr9)
    (adjacent kitchen2 dr10)

    (adjacent dr1 kitchen1)
    (adjacent dr1 dr2)
    (adjacent dr1 dr6)

    (adjacent dr2 dr1)
    (adjacent dr2 dr3)
    (adjacent dr2 dr7)

    (adjacent dr3 kitchen2)
    (adjacent dr3 dr8)
    (adjacent dr3 dr2)
    
    (adjacent dr4 kitchen1)
    (adjacent dr4 dr5)
    (adjacent dr4 dr11)

    (adjacent dr5 kitchen1)
    (adjacent dr5 dr4)
    (adjacent dr5 dr6)
    (adjacent dr5 dr12)

    (adjacent dr6 dr1)
    (adjacent dr6 dr7)
    (adjacent dr6 dr5)
    (adjacent dr6 dr13)

    (adjacent dr7 dr2)
    (adjacent dr7 dr6)
    (adjacent dr7 dr8)
    (adjacent dr7 dr14)

    (adjacent dr8 dr3)
    (adjacent dr8 dr7)
    (adjacent dr8 dr9)
    (adjacent dr8 dr15)

    (adjacent dr9 kitchen2)
    (adjacent dr9 dr8)
    (adjacent dr9 dr10)
    (adjacent dr9 dr16)

    (adjacent dr10 kitchen2)
    (adjacent dr10 dr9)
    (adjacent dr10 hall)

    (adjacent dr11 dr4)
    (adjacent dr11 dr12)

    (adjacent dr12 dr5)
    (adjacent dr12 dr11)
    (adjacent dr12 dr13)

    (adjacent dr13 dr6)
    (adjacent dr13 dr12)
    (adjacent dr13 dr14)

    (adjacent dr14 dr7)
    (adjacent dr14 dr13)
    (adjacent dr14 dr15)

    (adjacent dr15 dr8)
    (adjacent dr15 dr14)
    (adjacent dr15 dr16)

    (adjacent hall dr10)
    (adjacent hall dr16)

    ; Initial state
    (robot-at dr3)
    (dish-at dish1 kitchen1)
    (dish-at dish2 kitchen2)
    (free-hands)
    
    ; All tables locations
    (table-at table1 dr14)
    
    ; Orders
    (order-at dish1 table1)
    (order-at dish2 table1)
  )
  
  (:goal (and
    (served dish1 table1)
    (served dish2 table1)
    (robot-at kitchen1)
  ))
)

; plan
1. (move dr3 kitchen2)
   deleted: (robot-at dr3)
   added: (robot-at kitchen2)
   goals met: 0 of 3
2. (pick-up dish2 kitchen2)
   deleted: (free-hands) (dish-at dish2 kitchen2)
   added: (carrying dish2)
   goals met: 0 of 3
3. (move kitchen2 dr3)
   deleted: (robot-at kitchen2)
   added: (robot-at dr3)
   goals met: 0 of 3
4. (move dr3 dr2)
   deleted: (robot-at dr3)
   added: (robot-at dr2)
   goals met: 0 of 3
5. (move dr2 dr7)
   deleted: (robot-at dr2)
   added: (robot-at dr7)
   goals met: 0 of 3
6. (move dr7 dr14)
   deleted: (robot-at dr7)
   added: (robot-at dr14)
   goals met: 0 of 3
7. (present-dish dish2 dr14 table1)
   deleted: (carrying dish2)
   added: (served dish2 table1) (free-hands)
   goals met: 1 of 3
8. (move dr14 dr7)
   deleted: (robot-at dr14)
   added: (robot-at dr7)
   goals met: 1 of 3
9. (move dr7 dr2)
   deleted: (robot-at dr7)
   added: (robot-at dr2)
   goals met: 1 of 3
10. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 1 of 3
11. (move dr1 kitchen1)
   deleted: (robot-at dr1)
   added: (robot-at kitchen1)
   goals met: 2 of 3
12. (pick-up dish1 kitchen1)
   deleted: (free-hands) (dish-at dish1 kitchen1)
   added: (carrying dish1)
   goals met: 2 of 3
13. (move kitchen1 dr1)
   deleted: (robot-at kitchen1)
   added: (robot-at dr1)
   goals met: 1 of 3
14. (move dr1 dr2)
   deleted: (robot-at dr1)
   added: (robot-at dr2)
   goals met: 1 of 3
15. (move dr2 dr7)
   deleted: (robot-at dr2)
   added: (robot-at dr7)
   goals met: 1 of 3
16. (move dr7 dr14)
   deleted: (robot-at dr7)
   added: (robot-at dr14)
   goals met: 1 of 3
17. (present-dish dish1 dr14 table1)
   deleted: (carrying dish1)
   added: (served dish1 table1) (free-hands)
   goals met: 2 of 3
18. (move dr14 dr7)
   deleted: (robot-at dr14)
   added: (robot-at dr7)
   goals met: 2 of 3
19. (move dr7 dr2)
   deleted: (robot-at dr7)
   added: (robot-at dr2)
   goals met: 2 of 3
20. (move dr2 dr1)
   deleted: (robot-at dr2)
   added: (robot-at dr1)
   goals met: 2 of 3
21. (move dr1 kitchen1)
   deleted: (robot-at dr1)
   added: (robot-at kitchen1)
   goals met: 3 of 3
